result={
    "exchange_format_error" : ["shp","geojson або gbd"],
    "missing_layers":
    [
        "Імя шару1", #імя шару згідно структури, що відсутній в базі
        "Імя шару2",
        "Імя шару3"
    ]
    ,
    "layers":
    {
        "Озеленення" : #layer.name()
        {
            "layer_id": 'green_pg_3e767f91_8cde_4557_a9a4_a35465c712f6', #layer.id()
            "layer_name_errors": #Якщо перевірялося створити але залишити пустим якщо помилок нема
            {
                "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва класу «{назва класу}» не відповідає структурі
                "capital_leters" : True, #В назві класу «{назва класу}» наявні великі літери
                "used_alias" : "правильне імя", #Замість назви класу використано псевдонім «{назва класу}», вимагається «{коректна назва класу}»
                "spaces_used" : True, #В назві класу «{назва класу}» є пробіли
                "used_cyrillic" : True #В назві класу «{назва класу}» є кирилиця
            },
            "layer_invalid": True, #Шар НЕ ВАЛІДНИЙ Після цього подальші первірки не повинні здійснюватися #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "wrong_geometry_type" : ["точка", "полілінія"],#як є, як має бути #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "wrong_layer_CRS" : ["EPSG:7825","EPSG:5562"],#як є, як має бути #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "field_errors":{
                "missing_fields" : ["назва поля", "назва поля", "назва поля"],#Відсутні деякі атрибути класу #Якщо перевірялося створити але залишити пустим якщо помилок нема
                "field_name_errors" : 
                {
                    "назва атрибуту1" :
                    {
                        "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва атрибута «{назва атрибута}» не відповідає структурі
                        "capital_leters" : True, #В назві атрибута «{назва атрибута}» наявні великі літери
                        "used_alias" : "правильне імя", #Замість назви атрибуту використано псевдонім «{назва атрибуту}», вимагається «{коректна назва атрибуту}»
                        "spaces_used" : True #В назві атрибуту «{назва атрибуту}» є пробіли
                    },
                    "назва атрибуту2" : 
                    {
                        "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва атрибута «{назва атрибута}» не відповідає структурі
                        "capital_leters" : True, #В назві атрибута «{назва атрибута}» наявні великі літери
                        "used_alias" : "правильне імя", #Замість назви атрибуту використано псевдонім «{назва атрибуту}», вимагається «{коректна назва атрибуту}»
                        "spaces_used" : True #В назві атрибуту «{назва атрибуту}» є пробіли
                    }
                },
                "wrong_field_type" : #Типи атрибутів в шарі не відповідають сруктурі
                {
                "поле7" : ["LongInteger", "String"],#як є/як має бути
                "поле17" : ["String", "Double"]
            },
            },
            "is_empty": True, #В шарі відсутні об'єкти #False якщо помилки нема
            "features" :
            {
                0: #створювати словник навіть якщо нема помилок
                {
                    "geometry errors": 
                    {
                        "empty" : True, #Якщо перевірялося False якщо помилок нема
                        "null" : True, #Якщо перевірялося False якщо помилок нема
                        "geometry_type_wrong" : ["Поінт", "Полілайн"],#як є/як має бути Об'єкт має неправильний тип геометрії. Поточний тип - "{current_type}". Тип згідно структури - "{required_type}"#Якщо перевірялося створити але залишити пустим якщо помилок нема
                        "validator_error" :#Якщо перевірялося створити але залишити пустим якщо помилок нема
                        [
                            ["Дублікат точки", (1531.5315, 5315.53153)], 
                            ["Самопересічення", (1531.5315, 5315.53153)],
                            ["помилка3"]
                        ],
                        "outside_crs_extent" : [(1531.5315, 5315.53153),(1531.5315, 5315.53153)],#Extent #Якщо перевірялося створити але залишити пустим якщо помилок нема
                        
                    },
                    "duplicated_GUID" : #Якщо перевірялося створити але залишити пустим якщо помилок нема
                    [
                        [0, "building_reg_lines_5cb7aeec_7ef3_4d54_b247_f98527574096"],
                        [0, "dpt_area_354a5418_99e1_4751_b145_7567d6446c1e"]
                        #["id об'єкту4", "id шару1"],
                        #["id об'єкту3", "id шару5"]
                    ],
                    "required_attribute_empty" : ["атрибут1", "атрибут2", "атрибут3"], #Якщо перевірялося створити але залишити пустим якщо помилок нема
                    "attribute_length_exceed" : #Якщо перевірялося створити але залишити пустим якщо помилок нема
                    {
                        "атрибут1":[270, 255],#як є/як доволено
                        "атрибут2":[320, 255],
                        "атрибут3":[256, 255]
                    },
                    "attribute_value_unclassifyed" : 
                    {
                        "атрибут1":["Значення атрибуту 1", "посилання на документ з цим кластифікатором для хелпа(необовязково)"],
                        "атрибут2":["Значення атрибуту 2", "посилання на документ з цим кластифікатором для хелпа(необовязково)"],
                        "атрибут3":["Значення атрибуту 3", "посилання на документ з цим кластифікатором для хелпа(необовязково)"]
                    },
                    "topology_errors" : #Треба буде рішити як то перевіряти, поки в сам клас додавам для галочки
                    {
                        "Опис правила топології1" : 
                        {
                            "layer_out": "шар відносно якого перевірялося правило", #якщо ні, вважається що конфлікт всередині шару
                            "object_out" : "ID об'єкту з яким конфліктує" #якщо ні вважається шо з самим собою
                        },
                        "Опис правила топології2" :
                        {
                            "layer_out": "шар відносно якого перевірялося правило", #якщо ні, вважається що конфлікт всередині шару
                            "object_out" : "ID об'єкту з яким конфліктує" #якщо ні вважається шо з самим собою
                        }
                    }
                }
            }
        }
        
    }
}
