'''
опис дерева:
- файл
  помилки...
    - шар
      помилки...
        - об'єкт
          помилки...

відображення дерева помилок:
- з усіма перевірками
- тільки з помилками
- тільки критичні помилки

відображення файлу з якого брались шари в дереві
- так
- тільки бази геоданих
- ні(тільки якшо нема помилки формату обмінного файлу)

відображення списку помилок:
    - фільтрація за типом елементу(галочки, сховати помилки що відносяться до не ви ділених типів об'єктів)
        * шар
        * об'єкт
        * файл
    
    - фільтрація за конкретними файлами або шарами(галочки, показати тіки помилки в вибраних файлах та шарах)
        - кнопки виділити все і зняти виділення
        
    - фільтрація за типом помилки(галочки)
        * помилки ...
        * помилки ...

    сортування:
    - по алфавіту
    - по критичності

міні статистика:
- кількість файлів
- кількість шарів
- кількість об'єктів
- кількість помилок
- статистика по типах помилок

плашка: "пройшла або не пройшла перевірку з кількістю критичних та не критичних помилок"(фігня твоя робота студенте)
плашка: "були проведені не всі перевірки!" - для варіантів коли в стартовому вікні вибиралися не всі перевірки

кнопка: надрукувати звіт
кнопка: зберегти обмінник звіту
кнопка: завантажити обмінник звіту

меню правої клавіші(кожен наступний включає пункти вищого рівня):
    задонатити на ЗСУ(1)
    обмінник:
    - перейти до папки з обмінними файлами(з виділенням файлу)
    шар:
    - додати шар в qgis(якшо шар не підгружено в qgis)
    - виділити шар(якшо файл підгружений в QGIS)
    - відкрити налаштування шару(якшо файл підгружений в QGIS)
    - відкрити таблицю атрибутів шару(якшо файл підгружений в QGIS)
    об'єкт
    - виділити об'єкт та активувати шар(якшо файл підгружений в QGIS)
    - наблизити до об'єкту
    - відкрити форму об'єкту
    Помилка
    - перейти на сторінку help(якшо він є)
    - виправити помилку(з викликом додаткового вікна з роз'ясненням алгоритму виправлення)(ви точно хочете внести зміни в поточну базу даних? Зробіть резервну копію!)
        *назви шарів атрибутів
        *тип поля
        *тип геометрії
        *СК
        *додати поля
        *видалити поля
        *виправити не унікальний GUID
        *підвантажити домени
        *корекція геометрії
    - виділення помилок геометрії і топології через ribbon(зняти виділення при переході на іншу помилку)(можливо зробити автоматичне виділення при активації елементу помилки)
    - перейти до наступної помилки геометрії або топології
    - перейти до об'єкту відносно якого була помилка(наприклад топології або відношень)
    - перезберегти/клонувати обмінник в правильний формат

    №№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№
    ОПИС СТРУКТУРИ
    №№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№№

    Загальні атрибути для всіх об'єктів:

        'type' : 'container'/'file'/'layer'/'feature'/'inspection' * #для фільтрування
        'item_name' : -назва рядку у вікні- * #назва яка буде відображатися 
        'item_tooltip' : -підказка- #те що буде виводитися в першому рядку підказки, опціонально
        'help_url' : "-посилання_на_сторінку_хелпу_з_описом_форматів-"
        'subitems' : [-список дочірніх елементів-]

    Для типу file:

        'related_file_path' : "-повний_шлях_до_файлу-" #задається тільки для типу file, якшо створити в якомусь з дочірніх елементів - цей елемент та всі його дочірні елементи будуть мати оцей новий шлях
        TBD
        
    
    Для типу layer:

        'related_layer_id' : "-ідентифікатор шару для qgis-" #задається тільки для типу layer все інше аналогічно file_path
        'real_layer_name' : "-справжня назва шару з того шо прийшло з стартового вікна-"*
        'visible_layer_name' : "-відображувана назва шару з того шо прийшло з стартового вікна-",
    

    для типу feature:

        'related_feature_id' : "-ідентифікатор об'єкту-" (тільк для елементів шо мають related_layer_id) #задається тільки для типу feature, все інше аналогічно related_layer_id
        #
        TBD

    для типу inspection:
        
        'inspection_type_name' :  #Кожна перевірка має починатися зі слова "Перевірка" аби я міг то відміняти при біді
            "Перевірка формату геоданих"
            "Перевірка наявності обов’язкових шарів"
            "Перевірка помилки в назвах шарів"
            "Перевірка валідності шару"
            "Перевірка на тип геометрії"
            "Перевірка на систему координат шару"
            ####"Перевірка на відсутність полів (атрибутів)"
            "Перевірка на відсутність обов’язкових полів"
            "Перевірка на відсутність обов’язкових атрибутів"
            "Перевірка назв полів"
            "Перевірка назв атрибутів"
            "Перевірка типу полів"
            "Перевірка типу атрибутів"
            "Перевірка на наявність об’єктів в шарі"
            "Перевірка типу геометрії об’єкта"
            "Перевірка чи пуста геометрія об’єкта"
            "Перевірка чи є геометрія об’єкта null"
            "Перевірка дублювання GUID (унікального атрибуту)"
            "Перевірка чи є пустим (пуста строчка) обов’язковий атрибут"
            "Перевірка чи обов’язковий атрибут є null"
            "Перевірка довжини значення атрибута"
            "Перевірка формату значення атрибуту"
            "Перевірка чи значення атрибуту є в переліку доменів"
            "Перевірка топології"
            ....
        'criticity' : 0/1/2/-1 * # тип int критичність помилки, від 0 - не помилка до 2 -критична помилка, -1 - невдала перевірка - буде відображатися окремим значком    'item_name': -назва рядку у вікні- * (якшо оцю штуку зробити списком для помилкок, то воно виведе назву типу помилки: і окремі піделементи)
        error_geometry: {
            'crs' : 'EPSG:4326' * #(epsg код ск в якій будуть передані координати)
            'error_points' : [-точки-] #(воно буде виводити ці координати як піделементи, з номерами попорядку в WKT string)
            'error_polygons' : [-полігони-] #(воно буде виводити ці елементи як піделементи помилки, з номерами попорядку в WKT string)
        }
        'corresponding_objects' : [ #для помилок дублювання, відношень і топології
            {
            'related_layer_id' : "-ідентифікатор шару-" *
            'related_feature_id' : "-ідентифікатор об'єкту-" *
            'object_GIUD' : "-GUid об'єкту-" *
            'related_feature_visible_name' : -відображувана назва об'єкту-
            },
            ...
        ]
        'corrections' : [ *TBD
            'correction_type' : тип виправлення(треба буде скласти назви)*
            'current_value' : "існуюче значення" 
            'correct_value' : [-правильне значення-]
        ]
    
'''



result_v2 = [
    {
        'type' : 'container',
        'item_name' : "Загальні помилки",
        'subitems' : [
            {
                'type' : 'inspection',
                'inspetcion_type_name' : "Перевірка наявності обов’язкових шарів",
                'item_name' : "Відсутній шар 'Імя шару', що вимагається структурою",
                'criticity' : 1,
                'help_url' : "https://e-construction.gov.ua/laws_detail/3260441209981634046?doc_type=2"
            },
            {
                'type' : 'inspection',
                'inspetcion_type_name' : "Перевірка наявності обов’язкових шарів",
                'item_name' : "Відсутній шар 'Імя шару 2', що вимагається структурою",
                'criticity' : 1,
                'help_url' : "https://e-construction.gov.ua/laws_detail/3260441209981634046?doc_type=2"
            },
            { #а можна отак, тоді вони просто як підпункти виведуться, але це тіки при умові, шо нас влаштовує, що меню правої кнопки буде вести на один і той самий URL
                'type' : 'inspection',
                'inspection_category' : 'general',
                'inspetcion_type_name' : "Перевірка наявності обов’язкових шарів",
                'item_name' : [
                    "Відсутній шар 'Імя шару 1', що вимагається структурою",
                    "Відсутній шар 'Імя шару 2', що вимагається структурою",
                    "Відсутній шар 'Імя шару 3', що вимагається структурою",
                    "Відсутній шар 'Імя шару 4', що вимагається структурою"
                ],
                'criticity' : 1,
                'help_url' : "https://e-construction.gov.ua/laws_detail/3260441209981634046?doc_type=2"
            }
        ]
    },
    {
        'type' : 'file',
        'item_name' : "Файл 'блаблабла'",
        'related_file_path' : r"C:\Users\brych\OneDrive\Документы\01 Робота\98 Сторонні проекти\ua mbd team\Плагіни\Перевірка на МБД\Для тестування\EDRA від Богдана\buildings.geojson",
        'subitems' : [
            {
                'type' : 'inspection',
                'inspetcion_type_name' : "Перевірка формату геоданих",
                'criticity' : 0
            },
            {
                'type' : 'inspection',
                'inspetcion_type_name' : "Перевірка на наявність даних",
                'item_name' : "У файлі 'Імя файлу' відсутні дані",
                'criticity' : 1,
                'help_url' : "https://genius.com/Nirvana-smells-like-teen-spirit-lyrics"
            },
            
        ]
    },
    {
        'type' : 'file',
        'item_name' : "Файл 'Імя файлу'",
        'related_file_path' : r"C:\Users\brych\OneDrive\Документы\01 Робота\98 Сторонні проекти\ua mbd team\Плагіни\Перевірка на МБД\Для тестування\EDRA від Богдана\streets.geojson",
        'subitems' : [                
            {
                'type' : 'inspection',
                'inspetcion_type_name' : "Перевірка формату геоданих",
                'item_name' : "Формат файлу 'GDB' не відповідає вимогам, вимагається 'GEOJSON' або 'SHP'",
                'criticity' : 1,
                'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
            },
            {
                'type' : 'inspection',
                'inspetcion_type_name' : "Перевірка кодування файлу",
                'item_name' : "Кодування файлу 'WINDOWS-1251' не відповідає вимогам, вимагається 'UTF-8'",
                'criticity' : 1,
                'help_url' : "https://genius.com/Nirvana-rape-me-lyrics"
            },
            {
                'type' : 'inspection',
                'inspetcion_type_name' : "Перевірка на наявність даних",
                'criticity' : 0
            },
            {
                'type' : 'layer',
                'item_name' : "Шар 'Імя шару'",
                'real_layer_name' : "steets",
                'visible_layer_name' : "АТАТАТА",
                'related_layer_id' : 'dpt_area_002dcb97_0478_48d5_9667_367208a83219', #layer.id()
                'subitems' : [
                    {
                        'type' : 'inspection',
                        'inspetcion_type_name' : "Перевірка на тип геометрії",
                        'item_name' : "Тип геометрії шару 'Point' не відповідає структурі, вимагається 'LineString'",
                        'criticity' : 1,
                        'help_url' : "https://genius.com/Rammstein-du-hast-lyrics"
                    },
                    {
                        'type' : 'inspection',
                        'inspetcion_type_name' : "Перевірка на систему координат шару",
                        'item_tool_tip' : "А шо тии думав, шо тут буде підказка?",
                        'item_name' : "Система координат шару 'EPSG:9999' не відповідає структурі, вимагається 'EPSG:4326'",
                        'criticity' : 1,
                        'help_url' : "https://genius.com/Nirvana-rape-me-lyrics"
                    },
                    {
                        'type' : 'inspection',
                        'inspetcion_type_name' : "Перевірка на відсутність полів",
                        'item_name' : "В шарі відсутнє поле атрибуту 'Імя поля', що вимагається по структурі",
                        'criticity' : 1,
                        'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                    },
                    {
                        'type' : 'inspection',
                        'inspetcion_type_name' : "Перевірка на відсутність полів",
                        'item_name' : "В шарі відсутнє поле атрибуту 'Імя 2 поля', що вимагається по структурі",
                        'criticity' : 1,
                        'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                    },
                    {
                        'type' : 'feature',
                        'item_name' : "Об'єкт 'id об'єкту'",
                        'related_feature_id' : '1',
                        'subitems' : [
                            {
                                'type' : 'inspection',
                                'inspetcion_type_name' : "Перевірка наявності атрибутів",
                                'item_name' : "В об'єкті не заповнений атрибут 'Імя атрибуту', що вимагається по структурі",
                                'criticity' : 1,
                                'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                            },
                            {
                                'type' : 'inspection',
                                'inspetcion_type_name' : "Перевірка наявності атрибутів",
                                'item_name' : "В об'єкті не заповнений атрибут 'Імя 2 атрибуту', що вимагається по структурі",
                                'criticity' : 1,
                                'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                            },
                            {
                                'type' : 'inspection',
                                'inspetcion_type_name' : "Перевірка типу геометрії об’єкта",
                                'item_name' :  "Тип геометрії об'єкту 'Point' не відповідає структурі, вимагається 'LineString'",
                                'criticity' : 1,
                                'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                            },
                            {
                                'type' : 'inspection',
                                'inspetcion_type_name' : "Перевірка на наявність об’єктів в шарі",
                                'item_name' :  "В шарі відсутні об’єкти, що вимагається по структурі",
                                'criticity' : 1,
                                'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                            },
                            {
                                'type' : 'inspection',
                                'inspetcion_type_name' : "Перевірка дублювання GUID (унікального атрибуту)",
                                'item_name' :  "GUID не унікальний в межах шарів що валідуються",
                                'corresponding_objects' : [
                                    {
                                        'corrsesponding_layer_id' : 'dpt_area_002dcb97_0478_48d5_9667_367208a83219',
                                        'corrsesponding_feature_id' : '1',
                                        'related_object_visible_name' : 'Імя об’єкту'
                                    }
                                ],
                                'criticity' : 1,
                                'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                            },
                            {
                                'type' : 'inspection',
                                'inspetcion_type_name' : "Перевірка чи значення атрибуту є в переліку доменів",
                                'item_name' :  "Значення атрибуту 'Імя' не відповідає класифікатору, що вимагається по структурі",
                                'criticity' : 1,
                                'help_url' : "https://genius.com/Evanescence-lithium-lyrics"
                            }
                        ]
                    }
                ]
                
            }
        ]
                
            
    }
    

]



result = {
    "exchange_format_error" : ["shp","geojson або gbd"],
    "missing_layers":
    [
        "Імя шару1", #імя шару згідно структури, що відсутній в базі
        "Імя шару2",
        "Імя шару3"
    ]
    ,
    "layers":
    {
        'dpt_area_002dcb97_0478_48d5_9667_367208a83219' : #layer.id()
        {
            "layer_name": 'Шарара', #видиме ім'я layer.name(), що використовується для виводу у вікно результатів
            "layer_real_name": "Імя шару", #справжнє ім'я, що використовується для перевірок
            
            "layer_name_errors": #Якщо перевірялося створити але залишити пустим якщо помилок нема
            {
                "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва класу «{назва класу}» не відповідає структурі
                "capital_leters" : True, #В назві класу «{назва класу}» наявні великі літери
                "used_alias" : "правильне імя", #Замість назви класу використано псевдонім «{назва класу}», вимагається «{коректна назва класу}»
                "spaces_used" : True, #В назві класу «{назва класу}» є пробіли
                "used_cyrillic" : True #В назві класу «{назва класу}» є кирилиця
            },
            "layer_invalid": True, #Шар НЕ ВАЛІДНИЙ Після цього подальші первірки не повинні здійснюватися #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "wrong_geometry_type" : ["точка", "полілінія"],#як є, як має бути #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "wrong_layer_CRS" : ["EPSG:7825","EPSG:5562"],#як є, як має бути #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "field_errors":{
                "missing_fields" : ["назва поля", "назва поля", "назва поля"],#Відсутні деякі атрибути класу #Якщо перевірялося створити але залишити пустим якщо помилок нема
                "missing_required_fields" : ["назва поля", "назва поля", "назва поля"],#Відсутні деякі атрибути класу #Якщо перевірялося створити але залишити пустим якщо помилок нема
                "field_name_errors" : 
                {
                    "назва атрибуту1" :
                    {
                        "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва атрибута «{назва атрибута}» не відповідає структурі
                        "capital_leters" : True, #В назві атрибута «{назва атрибута}» наявні великі літери
                        "used_alias" : "правильне імя", #Замість назви атрибуту використано псевдонім «{назва атрибуту}», вимагається «{коректна назва атрибуту}»
                        "spaces_used" : True, #В назві атрибуту «{назва атрибуту}» є пробіли
                        "used_cyrillic" : True #В назві класу «{назва класу}» є кирилиця
                    },
                    "назва атрибуту2" : 
                    {
                        "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва атрибута «{назва атрибута}» не відповідає структурі
                        "capital_leters" : True, #В назві атрибута «{назва атрибута}» наявні великі літери
                        "used_alias" : "правильне імя", #Замість назви атрибуту використано псевдонім «{назва атрибуту}», вимагається «{коректна назва атрибуту}»
                        "spaces_used" : True, #В назві атрибуту «{назва атрибуту}» є пробіли
                        "used_cyrillic" : True #В назві класу «{назва класу}» є кирилиця
                    }
                },
                "wrong_field_type" : #Типи атрибутів в шарі не відповідають сруктурі
                {
                "поле7" : ["LongInteger", "String"],#як є/як має бути
                "поле17" : ["String", "Double"]
            },
            },
            "is_empty": True, #В шарі відсутні об'єкти #False якщо помилки нема
            "features":
            {
                1: #створювати словник навіть якщо нема помилок
                {
                    "geometry_errors": 
                    {
                        "empty" : True, #Якщо перевірялося False якщо помилок нема
                        "null" : True, #Якщо перевірялося False якщо помилок нема
                        "geometry_type_wrong" : ["Поінт", "Полілайн"],#як є/як має бути Об'єкт має неправильний тип геометрії. Поточний тип - "{current_type}". Тип згідно структури - "{required_type}"#Якщо перевірялося створити але залишити пустим якщо помилок нема
                        "validator_error" :#Якщо перевірялося створити але залишити пустим якщо помилок нема
                        [
                            ["Дублікат точки", (1531.5315, 5315.53153)], #зауваж шо точка має бути в координатах
                            ["Самопересічення", (1531.5315, 5315.53153)],
                            ["помилка3"]
                        ],
                        "outside_crs_extent" : [(1531.5315, 5315.53153),(1531.5315, 5315.53153)],#Extent #Якщо перевірялося створити але залишити пустим якщо помилок нема
                        
                    },
                    "duplicated_GUID" : #Якщо перевірялося створити але залишити пустим якщо помилок нема        
                    #формат виводу з класу DRA_exchange_layer_checker {guid:[(layer, feature_id), (layer, feature_id)....]}
                    [
                        [1, "str_residential_f62c29e3_9f41_492d_be30_88d8b05ae820"],
                        [1, "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858"],
                        [2, "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858"],
                        [3, "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858"]
                        #["id об'єкту4", "id шару1"],
                        #["id об'єкту3", "id шару5"]
                    ],
                    "required_attribute_null" : ["атрибут1", "атрибут2", "атрибут3"], #перевірка на null
                    "required_attribute_empty" : ["атрибут1", "атрибут2", "атрибут3"], #перевікрка на пустут строчку
                    "attribute_length_exceed" : #Якщо перевірялося створити але залишити пустим якщо помилок нема
                    {
                        "атрибут1":[270, 255],#як є/як доволено
                        "атрибут2":[320, 255],
                        "атрибут3":[256, 255]
                    },
                    "attribute_value_format_wrong" : #домени не домени
                    {
                        "cur_value" : "значення",
                        "template" : "шаблон"
                    },
                    "attribute_value_unclassifyed" : 
                    {
                        "атрибут1":["Значення атрибуту 1", "посилання на документ з цим кластифікатором для хелпа(необовязково)"],
                        "атрибут2":["Значення атрибуту 2", "посилання на документ з цим кластифікатором для хелпа(необовязково)"],
                        "атрибут3":["Значення атрибуту 3", "посилання на документ з цим кластифікатором для хелпа(необовязково)"]
                    },
                    "topology_errors" : #Треба буде рішити як то перевіряти, поки в сам клас додавам для галочки
                    {
                        "Опис правила топології1": 
                        {
                            "layer_out": "str_residential_f62c29e3_9f41_492d_be30_88d8b05ae820", #якщо ні, вважається що конфлікт всередині шару
                            "object_out" : 1 #якщо ні вважається шо з самим собою
                        },
                        "Опис правила топології2":
                        {
                            "layer_out": "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858", #якщо ні, вважається що конфлікт всередині шару
                            "object_out" : 2 #якщо ні вважається шо з самим собою
                        }
                    }
                }
            }
        }
        
    }
}
