'''
опис дерева:
- файл
  помилки...
    - шар
      помилки...
        - об'єкт
          помилки...

відображення дерева помилок:
- з усіма перевірками
- тільки з помилками
- тльки критичні помилки

відображення файлу з якого брались шари в дереві
- так
- ні(тільки якшо нема помилки формату обмінного файлу)

відображення списку помилок:
    - фільтрація за типом елементу(галочки)
        * шар
        * об'єкт
        * файл
    
    - фільтрація за типом помилки(галочки)
        * помилки ...
        * помилки ...

    сортування:
    - по алфавіту
    - по критичності

міні статистика:
- кількість файлів
- кількість шарів
- кількість об'єктів
- кількість помилок
- статистика по типах помилок

плашка: "пройшла або не пройшла перевірку з кількістю критичних та не критичних помилок"(фігня твоя робота студенте)
плашка: "були проведені не всі перевірки!" - для варіантів коли в стартовому вікні вибиралися не всі перевірки

кнопка: надрукувати звіт
кнопка: зберегти обмінник звіту
кнопка: завантажити обмінник звіту

меню правої клавіші(кожен наступний включає пункти вищого рівня):
    задонатити на ЗСУ(1)
    обмінник:
    - перейти до папки з обмінними файлами(з виділенням файлу)
    шар:
    - додати шар в qgis(якшо шар не підгружено в qgis)
    - виділити шар(якшо файл підгружений в QGIS)
    - відкрити налаштування шару(якшо файл підгружений в QGIS)
    - відкрити таблицю атрибутів шару(якшо файл підгружений в QGIS)
    об'єкт
    - виділити об'єкт та активувати шар(якшо файл підгружений в QGIS)
    - наблизити до об'єкту
    - відкрити форму об'єкту
    Помилка
    - перейти на сторінку help(якшо він є)
    - виправити помилку(з викликом додаткового вікна з роз'ясненням алгоритму виправлення)(ви точно хочете внести зміни в поточну базу даних? Зробіть резервну копію!)
        *назви шарів атрибутів
        *тип поля
        *тип геометрії
        *СК
        *додати поля
        *видалити поля
        *виправити не унікальний GUID
        *підвантажити домени
        *корекція геометрії
    - виділення помилок геометрії і топології через ribbon(зняти виділення при переході на іншу помилку)(можливо зробити автоматичне виділення при активації елементу помилки)
    - перейти до наступної помилки геометрії або топології
    - перезберегти/клонувати обмінник в правильний формат

'''

result_v2 = {
    "exchange_file_errors" : 
    {
        'type' : 'branch',
        'name' : "Помилки обмінних файлів",
        "-повний шлях до файлу 1-" :
        {
            'type' : 'error',
            'error_category' : 'general', #обов'язкове поле
            'error_name' : "Помилка формату завантаженого обмінного файлу", #обов'язкове поле
            'error_descriprion' : "Наявна помилка в форматі обмінного файлу: -імя файлу N- - обмінний файл має формат -(.shp, .geojson або .gbd)-",#обов'язкове поле
            'fle_path' : "-повний_шлях_до_файлу-",
            'real_layer_name' : "-справжня назва шару з того шо прийшло з стартового вікна-",
            'visible_layer_name' : "-відображувана назва шару з того шо прийшло з стартового вікна-",
            'layer_id' : "-ідентифікатор шару-",
            'help_url' : "-посилання_на_сторінку_хелпу_з_описом_форматів-"
        },
        "-повний шлях до файлу N-" :
        {
            'type' : 'error',
            'error_category' : 'general', #обов'язкове поле
            'error_name' : "Помилка відкриття завантаженого обмінного файлу", #обов'язкове поле
            'error_descriprion' : "Не можливо відкрити обмінний файл: -імя_файлу_N- (помилка: -err-)", #обов'язкове поле
            'fle_path' : "-повний шлях до файлу-",
            'real_layer_name' : "-справжня назва шару з того шо прийшло з стартового вікна-",
            'visible_layer_name' : "-відображувана назва шару з того шо прийшло з стартового вікна-",
            'layer_id' : "-ідентифікатор шару-",
            'help_url' : "-посилання_на_сторінку_хелпу_з_описом_форматів-"
        }
        
    },
    "missing_layers" :
    {
        'type' : 'error',
        'name' : "Відсутній шар",
        'error_category' : 'general', #обов'язкове поле
        'error_name' : "Відсутній шар", #обов'язкове поле
        'error_descriprion' : 
        [
            "-назва_шару_1_з_описом-",
            "-назва_шару_2_з_описом-",
            "-назва_шару_N_з_описом-",
        ],
        'help_url' : "-посилання_на_сторінку_хелпу_з_описом_форматів-"
            
    }





result = {
    "exchange_format_error" : ["shp","geojson або gbd"],
    "missing_layers":
    [
        "Імя шару1", #імя шару згідно структури, що відсутній в базі
        "Імя шару2",
        "Імя шару3"
    ]
    ,
    "layers":
    {
        'dpt_area_002dcb97_0478_48d5_9667_367208a83219' : #layer.id()
        {
            "layer_name": 'Шарара', #видиме ім'я layer.name(), що використовується для виводу у вікно результатів
            "layer_real_name": "Імя шару", #справжнє ім'я, що використовується для перевірок
            
            "layer_name_errors": #Якщо перевірялося створити але залишити пустим якщо помилок нема
            {
                "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва класу «{назва класу}» не відповідає структурі
                "capital_leters" : True, #В назві класу «{назва класу}» наявні великі літери
                "used_alias" : "правильне імя", #Замість назви класу використано псевдонім «{назва класу}», вимагається «{коректна назва класу}»
                "spaces_used" : True, #В назві класу «{назва класу}» є пробіли
                "used_cyrillic" : True #В назві класу «{назва класу}» є кирилиця
            },
            "layer_invalid": True, #Шар НЕ ВАЛІДНИЙ Після цього подальші первірки не повинні здійснюватися #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "wrong_geometry_type" : ["точка", "полілінія"],#як є, як має бути #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "wrong_layer_CRS" : ["EPSG:7825","EPSG:5562"],#як є, як має бути #Якщо перевірялося створити але залишити пустим якщо помилок нема
            "field_errors":{
                "missing_fields" : ["назва поля", "назва поля", "назва поля"],#Відсутні деякі атрибути класу #Якщо перевірялося створити але залишити пустим якщо помилок нема
                "missing_required_fields" : ["назва поля", "назва поля", "назва поля"],#Відсутні деякі атрибути класу #Якщо перевірялося створити але залишити пустим якщо помилок нема
                "field_name_errors" : 
                {
                    "назва атрибуту1" :
                    {
                        "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва атрибута «{назва атрибута}» не відповідає структурі
                        "capital_leters" : True, #В назві атрибута «{назва атрибута}» наявні великі літери
                        "used_alias" : "правильне імя", #Замість назви атрибуту використано псевдонім «{назва атрибуту}», вимагається «{коректна назва атрибуту}»
                        "spaces_used" : True, #В назві атрибуту «{назва атрибуту}» є пробіли
                        "used_cyrillic" : True #В назві класу «{назва класу}» є кирилиця
                    },
                    "назва атрибуту2" : 
                    {
                        "general" : [True,"Посилання на сторінку хелпу з переліком атрибутів"], #Назва атрибута «{назва атрибута}» не відповідає структурі
                        "capital_leters" : True, #В назві атрибута «{назва атрибута}» наявні великі літери
                        "used_alias" : "правильне імя", #Замість назви атрибуту використано псевдонім «{назва атрибуту}», вимагається «{коректна назва атрибуту}»
                        "spaces_used" : True, #В назві атрибуту «{назва атрибуту}» є пробіли
                        "used_cyrillic" : True #В назві класу «{назва класу}» є кирилиця
                    }
                },
                "wrong_field_type" : #Типи атрибутів в шарі не відповідають сруктурі
                {
                "поле7" : ["LongInteger", "String"],#як є/як має бути
                "поле17" : ["String", "Double"]
            },
            },
            "is_empty": True, #В шарі відсутні об'єкти #False якщо помилки нема
            "features":
            {
                1: #створювати словник навіть якщо нема помилок
                {
                    "geometry_errors": 
                    {
                        "empty" : True, #Якщо перевірялося False якщо помилок нема
                        "null" : True, #Якщо перевірялося False якщо помилок нема
                        "geometry_type_wrong" : ["Поінт", "Полілайн"],#як є/як має бути Об'єкт має неправильний тип геометрії. Поточний тип - "{current_type}". Тип згідно структури - "{required_type}"#Якщо перевірялося створити але залишити пустим якщо помилок нема
                        "validator_error" :#Якщо перевірялося створити але залишити пустим якщо помилок нема
                        [
                            ["Дублікат точки", (1531.5315, 5315.53153)], #зауваж шо точка має бути в координатах
                            ["Самопересічення", (1531.5315, 5315.53153)],
                            ["помилка3"]
                        ],
                        "outside_crs_extent" : [(1531.5315, 5315.53153),(1531.5315, 5315.53153)],#Extent #Якщо перевірялося створити але залишити пустим якщо помилок нема
                        
                    },
                    "duplicated_GUID" : #Якщо перевірялося створити але залишити пустим якщо помилок нема        
                    #формат виводу з класу DRA_exchange_layer_checker {guid:[(layer, feature_id), (layer, feature_id)....]}
                    [
                        [1, "str_residential_f62c29e3_9f41_492d_be30_88d8b05ae820"],
                        [1, "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858"],
                        [2, "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858"],
                        [3, "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858"]
                        #["id об'єкту4", "id шару1"],
                        #["id об'єкту3", "id шару5"]
                    ],
                    "required_attribute_null" : ["атрибут1", "атрибут2", "атрибут3"], #перевірка на null
                    "required_attribute_empty" : ["атрибут1", "атрибут2", "атрибут3"], #перевікрка на пустут строчку
                    "attribute_length_exceed" : #Якщо перевірялося створити але залишити пустим якщо помилок нема
                    {
                        "атрибут1":[270, 255],#як є/як доволено
                        "атрибут2":[320, 255],
                        "атрибут3":[256, 255]
                    },
                    "attribute_value_format_wrong" : #домени не домени
                    {
                        "cur_value" : "значення",
                        "template" : "шаблон"
                    },
                    "attribute_value_unclassifyed" : 
                    {
                        "атрибут1":["Значення атрибуту 1", "посилання на документ з цим кластифікатором для хелпа(необовязково)"],
                        "атрибут2":["Значення атрибуту 2", "посилання на документ з цим кластифікатором для хелпа(необовязково)"],
                        "атрибут3":["Значення атрибуту 3", "посилання на документ з цим кластифікатором для хелпа(необовязково)"]
                    },
                    "topology_errors" : #Треба буде рішити як то перевіряти, поки в сам клас додавам для галочки
                    {
                        "Опис правила топології1": 
                        {
                            "layer_out": "str_residential_f62c29e3_9f41_492d_be30_88d8b05ae820", #якщо ні, вважається що конфлікт всередині шару
                            "object_out" : 1 #якщо ні вважається шо з самим собою
                        },
                        "Опис правила топології2":
                        {
                            "layer_out": "str_other_5f2261b3_2d82_4da2_b4e5_8cf315a22858", #якщо ні, вважається що конфлікт всередині шару
                            "object_out" : 2 #якщо ні вважається шо з самим собою
                        }
                    }
                }
            }
        }
        
    }
}
